# Packages

In [1]:
import pandas as pd
import numpy as np

# Pull in the Data

In [2]:
fk_dt = pd.read_csv('fake_data.csv')
fk_dt = pd.DataFrame(fk_dt)
print(fk_dt.shape)
fk_dt.head()

(499, 3)

  Category X      Date  Values
0   company3  1/2/2024     673
1   company1  1/3/2024    1407
2   company1  1/4/2024     399
3   company4  1/5/2024    2088
4   company3  1/6/2024    2609

# Import Class

In [3]:
from dt_clnr import dt_clnr

# Now you can use the DataCleaner class
cleaner = dt_clnr()

# Test

In [4]:
fk_dt2 = cleaner.cln_cl_nms(fk_dt)
cleaner.whatisthis(fk_dt2, 3)

Old Column Name Category X
New Name ctgry_x
Old Column Name Date
New Name dt
Old Column Name Values
New Name vls
Shape: (499, 3)
===================


===================
Columns with Most Unique Items
  column_names  unq_items
2          vls        463
1           dt         62
0      ctgry_x          6
===================


===================
List of All Columns: ['ctgry_x', 'dt', 'vls']

In [5]:
fk_dt3 = cleaner.expld_dts(fk_dt2, ['dt'])
fk_dt3

      ctgry_x         dt   vls  dt_yr  dt_mth
0    company3 2024-01-02   673   2024       1
1    company1 2024-01-03  1407   2024       1
2    company1 2024-01-04   399   2024       1
3    company4 2024-01-05  2088   2024       1
4    company3 2024-01-06  2609   2024       1
..        ...        ...   ...    ...     ...
494  company1 2024-03-02  2089   2024       3
495  company3 2024-03-03  1165   2024       3
496  company6 2024-01-02   465   2024       1
497  company4 2024-01-03  1647   2024       1
498  company1 2024-01-04  1422   2024       1

[499 rows x 5 columns]